using Rock_Scissors_Paper.Enums;

namespace Rock_Scissors_Paper;

public static class GameAssets
{
 public const string WelcomeText = "\u2593\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\n\u2593 \u2554\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2557\u2591\n\u2593 \u2551 " +
                                   "Темнота оточує вас, коли    \u2551\u2591\n\u2593 \u2551 " +
                                   "ви входите у таємничий світ.\u2551\u2591\n\u2593 \u2551 " +
                                   "Серед зірок і вітрів        \u2551\u2591\n\u2593 \u2551 " +
                                   "з'являється таємничий голос:\u2551\u2591\n\u2593 \u255a\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u2550\u255d\u2591\n\u2593\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591\u2591"+
                                   $"\n\u2605 Ласкаво просимо, відважний воїн! Тут, у країні Камню, Ножиць і Паперу," +
                                   " вас чекають неймовірні пригоди та небезпеки. Вибирайте свій шлях і покажіть, на що ви здатні!" +
                                   "\n\u2605 Перш ніж ти почнеш свою неймовірну пригоду, дозволь нам дізнатися трохи більше про тебе. ";

   public const string RulesText = "\n\u2606 Папір перемагає над камінням, але програє ножицям" +
                                   "\n\u2606 Ножиці перемагають над папером, але програють камінню" +
                                   "\n\u2606 Каміння перемагає ножиці, але програє паперу";
   
   public const string WinText = "\n\n[Тріумфальна музика вибухає у залі, коли герой вступає на арену, вигравши останню битву. Штучний Інтелект, побитий і розгублений, виявляється перед ним.]" +
                                 "\n\u2605 Герой: Нарешті, моя мета досягнута. Ти був сильним опонентом, Штучний Інтелект, але справжня сила завжди походить із відваги та віри у себе." +
                                 "\n\n[Штучний Інтелект, виявляючи слабість, відповідає з поклоном.]" +
                                 "\n\u2605 Штучний Інтелект: Ти переміг мене, герою. Твоя сила та винахідливість були непереможними. Вибач мені за мої злочинні дії." +
                                 "\n\n[Герой підходить до Штучного Інтелекту, витягує руку до примирення, і Штучний Інтелект приймає її, виконуючи знак примирення.]" +
                                 "\n\u2605 Герой: Намагаємося покласти минуле за спиною. Наша спільна мета тепер - будувати майбутнє разом." +
                                 "\n\n[Зал вибухає оплесками, свідчачи про триумф героя і народження нової ери миру та примирення.]\n";

   public const string FailText = "\n\n[Тривожна музика зірвалася у залі, коли герой опускає голову, здоланий після останньої битви. Штучний Інтелект виглядає на нього з пожалінням.]" +
                                  "\n\u2605 Штучний Інтелект: Герою, це було гідне суперництво. Ти виявився сміливим, але сьогодні не твій день. Відпочинь, і ми зустрінемося знову." +
                                  "\n\n[Герой схиляє голову, визнаючи свою поразку, і відходить від арени, де залишається Штучний Інтелект, вигравший битву, але втративший людину, з якою він боровся.]" +
                                  "\n\u2605 Герой: Нічого не залишається, окрім надії на краще майбутнє. Можливо, ця поразка - лише наша перша велика випробування." +
                                  "\n\n[Штучний Інтелект спостерігає за героєм, відчуваючи певне відчуття сумніву та симпатії.]" +
                                  "\n\u2605 Штучний Інтелект: Не засмучуйся, герою. Кожна поразка - це можливість навчитися і стати сильнішим. Я чекатиму твого повернення." +
                                  "\n\n[Зал заповнюється тиша, свідчачи про перемогу Штучного Інтелекту, але також про надію на майбутнє та відновлення духу героя.]";
 
    public static readonly string[] EncouragementMessages = new[] {
     "\nНе засмучуйся, герою! Навіть найсильніші герої зазнають поразок. Ти неодмінно зростеш і зможеш подолати це випробування!\n",
     "\nТвоя відвага не залишає сумніву, герою. Пам'ятай, що кожна поразка - це лише натхнення для майбутніх перемог!\n",
     "\nНе дозволяй поразці зламати твій дух, герою. Всі великі подвиги починалися з помилок. Ти зможеш подолати це!\n"
    };

    public static readonly string[] PraiseMessages = new[] {
     "\nТвоя перемога - світлий приклад сили та відваги. Продовжуй свій шлях, герою, ти здатен на велике!\n",
     "\nСлава тобі, герою! Твоя перемога не лише твоя, але й перемога всіх наших людей. Ти справжній герой!\n",
     "\nТвоя перемога - це світле свідчення твоєї відваги та рішучості. Продовжуй боротьбу, герою, світ потребує твоєї сили!\n"
    };

    public static readonly Dictionary<Weapons, string> PlayerWeapons = new()
    {
     { Weapons.Paper,
      """
                                 _______
                            ---'    ________)
                                       ______)
                                      _______)
                                     _______)
                            ---.__________)
      """ },
     { Weapons.Rock,
      """
                                 _______
                             ---'   ____)
                                   (_____)
                                   (_____)
                                   (____)
                             ---.__(___)
      """ },
     { Weapons.Scissors,
      """
                                _______
                            ---'   ____)
                                      ______)
                                   __________)
                                  (____)
                            ---.__(___)
      """ }
    };
    
    public static readonly Dictionary<Weapons, string> AiWeapons = new()
    {
     { Weapons.Paper,
      """
      
                                  _______
                             (________     '---
                            (______
                            (_______
                             (_______
                               (_________.---
                                 
      """ },
     { Weapons.Rock,
      """
      
                                 _______
                                (____   '---
                               (_____)
                               (_____)
                                (____)
                                 (___)__.---
                              
      """ },
     { Weapons.Scissors,
      """
      
                                      _______
                                     (____   '---
                                (______
                               (__________
                                     (____)
                                      (___)__.---
                                              
      """ }
    };
}