namespace Rock_Scissors_Paper;

public static class GameAssets
{
   public static readonly string WelcomeText = "\u2727 \u02da \u3000· \u3000\u3000 . Темнота оточує вас, коли ви входите у таємничий світ. " +
                                               "Серед зірок і вітрів з'являється таємничий голос:"+
                                               "\u2605 Ласкаво просимо, відважний воїн! Тут, у країні Камню, Ножиць і Паперу," +
                                               " вас чекають неймовірні пригоди та небезпеки. Вибирайте свій шлях і покажіть, на що ви здатні!" +
                                               "\nПерш ніж ти почнеш свою неймовірну пригоду, дозволь нам дізнатися трохи більше про тебе. " +
                                               "\nБудь ласка, введи своє ім'я та вік, а потім ми розпочнемо нашу подорож разом!";

   public static readonly string RulesText = "\n\u2606 Папір перемагає над камінням, але програє ножицям" +
                                             "\n\u2606 Ножиці перемагають над папером, але програють камінню" +
                                             "\n\u2606 Каміння перемагає ножиці, але програє паперу";
   
   public static readonly string WinText = "[Тріумфальна музика вибухає у залі, коли герой вступає на арену, вигравши останню битву. Штучний Інтелект, побитий і розгублений, виявляється перед ним.]" +
                                           "Герой: Нарешті, моя мета досягнута. Ти був сильним опонентом, Штучний Інтелект, але справжня сила завжди походить із відваги та віри у себе." +
                                           "\n[Штучний Інтелект, виявляючи слабість, відповідає з поклоном.]" +
                                           "Штучний Інтелект: Ти переміг мене, герою. Твоя сила та винахідливість були непереможними. Вибач мені за мої злочинні дії." +
                                           "\n[Герой підходить до Штучного Інтелекту, витягує руку до примирення, і Штучний Інтелект приймає її, виконуючи знак примирення.]" +
                                           "Герой: Намагаємося покласти минуле за спиною. Наша спільна мета тепер - будувати майбутнє разом." +
                                           "\n[Зал вибухає оплесками, свідчачи про триумф героя і народження нової ери миру та примирення.]\n";

   public static readonly string FailText = "[Тривожна музика зірвалася у залі, коли герой опускає голову, здоланий після останньої битви. Штучний Інтелект виглядає на нього з пожалінням.]" +
                                            "Штучний Інтелект: Герою, це було гідне суперництво. Ти виявився сміливим, але сьогодні не твій день. Відпочинь, і ми зустрінемося знову." +
                                            "\n[Герой схиляє голову, визнаючи свою поразку, і відходить від арени, де залишається Штучний Інтелект, вигравший битву, але втративший людину, з якою він боровся.]" +
                                            "Герой: Нічого не залишається, окрім надії на краще майбутнє. Можливо, ця поразка - лише наша перша велика випробування." +
                                            "\n[Штучний Інтелект спостерігає за героєм, відчуваючи певне відчуття сумніву та симпатії.]" +
                                            "Штучний Інтелект: Не засмучуйся, герою. Кожна поразка - це можливість навчитися і стати сильнішим. Я чекатиму твого повернення." +
                                            "\n[Зал заповнюється тиша, свідчачи про перемогу Штучного Інтелекту, але також про надію на майбутнє та відновлення духу героя.]";
 
    public static readonly string[] EncouragementMessages = new[] {
     "Не засмучуйся, герою! Навіть найсильніші герої зазнають поразок. Ти неодмінно зростеш і зможеш подолати це випробування!",
     "Твоя відвага не залишає сумніву, герою. Пам'ятай, що кожна поразка - це лише натхнення для майбутніх перемог!",
     "Не дозволяй поразці зламати твій дух, герою. Всі великі подвиги починалися з помилок. Ти зможеш подолати це!"
    };

    public static readonly string[] PraiseMessages = new[] {
     "Твоя перемога - світлий приклад сили та відваги. Продовжуй свій шлях, герою, ти здатен на велике!",
     "Слава тобі, герою! Твоя перемога не лише твоя, але й перемога всіх наших людей. Ти справжній герой!",
     "Твоя перемога - це світле свідчення твоєї відваги та рішучості. Продовжуй боротьбу, герою, світ потребує твоєї сили!"
    };

    public static readonly string[] PlayerWeapons = new[]
    {
     //Paper
     """
                                               _______
                                          ---'    ________)
                                                     ______)
                                                    _______)
                                                   _______)
                                          ---.__________)
                                          
     """,
     //Rock
     """
                                             _______
                                         ---'   ____)
                                               (_____)
                                               (_____)
                                               (____)
                                         ---.__(___)
                                         
     """,
     //Scissors
     """
                                                 _______
                                             ---'   ____)
                                                       ______)
                                                    __________)
                                                   (____)
                                             ---.__(___)
                                             
     """
    };

    public static readonly string[] AiWeapons = new[]
    {
     """
     
                                 _______
                            (________     '---
                           (______
                           (_______
                            (_______
                              (_________.---
                                
     """,
     """
     
                                _______
                               (____   '---
                              (_____)
                              (_____)
                               (____)
                                (___)__.---
                             
     """,
     """
     
                                     _______
                                    (____   '---
                               (______
                              (__________
                                    (____)
                                     (___)__.---
                                             
     """
    };
}